seantippett/MultiSensor-with-Oryx/multisensor_oryx_freertos_cm7/board/pin_mux.c
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAA
mcu_data: ksdk2_0
processor_version: 0.9.6
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"
#include "fsl_gpio.h"

#include "app_shared.h"
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
 //   BOARD_InitPins();
    BOARD_InitMicPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/


void BOARD_InitPins_REV2(void) {


  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of CAMERA_VSYNC on GPIO_AD_20 (pin K13) */
    gpio_pin_config_t CAMERA_VSYNC_config = {
        .direction = kGPIO_DigitalInput,
        .outputLogic = 0U,
        .interruptMode = kGPIO_NoIntmode
    };
    /* Initialize GPIO functionality on GPIO_AD_20 (pin K13) */
    GPIO_PinInit(GPIO3, 19U, &CAMERA_VSYNC_config);
    IOMUXC_SetPinMux(
         IOMUXC_GPIO_AD_20_GPIO_MUX3_IO19,       /* GPIO_AD_20 is configured as GPIO_MUX3_IO19 */
         0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    /* GPIO configuration of TP_13 on GPIO_AD_21 (pin K14) */
      gpio_pin_config_t TP_13_config = {
          .direction = kGPIO_DigitalInput,
          .outputLogic = 0U,
          .interruptMode = kGPIO_NoIntmode
      };
      /* Initialize GPIO functionality on GPIO_AD_20 (pin K13) */
      GPIO_PinInit(GPIO3, 20U, &TP_13_config);
      IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_21_GPIO_MUX3_IO20,       /* GPIO_AD_21 is configured as GPIO_MUX3_IO20 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */


    /* GPIO configuration of UC_STROBE on GPIO_AD_23 (pin J12) */
    gpio_pin_config_t UC_STROBE_config = {
        .direction = kGPIO_DigitalOutput,
        .outputLogic = 0U,
        .interruptMode = kGPIO_NoIntmode
    };
    /* Initialize GPIO functionality on GPIO_AD_23 (pin J12) */
    GPIO_PinInit(GPIO3, 22U, &UC_STROBE_config);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_23_GPIO_MUX3_IO22,       /* GPIO_AD_23 is configured as GPIO_MUX3_IO22 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    /* GPIO configuration of CAMERA_SHUTTER_RESET on GPIO_AD_24 (pin L13) */
    gpio_pin_config_t CAMERA_SHUTTER_RESET_config = {
        .direction = kGPIO_DigitalOutput,
        .outputLogic = 0U,
        .interruptMode = kGPIO_NoIntmode
    };
    /* Initialize GPIO functionality on GPIO_AD_24 (pin L13) */
    GPIO_PinInit(GPIO3, 23U, &CAMERA_SHUTTER_RESET_config);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_24_GPIO_MUX3_IO23,       /* GPIO_AD_24 is configured as GPIO_MUX3_IO23 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    /* GPIO configuration of CAMERA_SHUTTER_SET on GPIO_AD_25 (pin M15) */
    gpio_pin_config_t CAMERA_SHUTTER_SET_config = {
        .direction = kGPIO_DigitalOutput,
        .outputLogic = 0U,
        .interruptMode = kGPIO_NoIntmode
    };
    /* Initialize GPIO functionality on GPIO_AD_25 (pin M15) */
    GPIO_PinInit(GPIO3, 24U, &CAMERA_SHUTTER_SET_config);
    IOMUXC_SetPinMux(
         IOMUXC_GPIO_AD_25_GPIO_MUX3_IO24,       /* GPIO_AD_25 is configured as GPIO_MUX3_IO24 */
         0U);                                    /* Software Input On Field: Input Path is determined by functionality */


    /* GPIO configuration of CAMERA_PWR_CTL_1V8 on GPIO_AD_26 (pin L14) */
    gpio_pin_config_t CAMERA_PWR_CTL_1V8_config = {
        .direction = kGPIO_DigitalOutput,
        .outputLogic = 0U,
        .interruptMode = kGPIO_NoIntmode
    };
    /* Initialize GPIO functionality on GPIO_AD_26 (pin L14) */
    GPIO_PinInit(GPIO3, 25U, &CAMERA_PWR_CTL_1V8_config);
    IOMUXC_SetPinMux(
       IOMUXC_GPIO_AD_26_GPIO_MUX3_IO25,       /* GPIO_AD_26 is configured as GPIO_MUX3_IO25 */
       0U);                                    /* Software Input On Field: Input Path is determined by functionality */

    /* GPIO configuration of 6V5_ENABLE on GPIO_DISP_B2_12 (pin B6) */
      gpio_pin_config_t ENABLE_6V5_config = {
          .direction = kGPIO_DigitalOutput,
          .outputLogic = 0U,
          .interruptMode = kGPIO_NoIntmode
      };
      /* Initialize GPIO functionality on GPIO_DISP_B2_12 (pin B6) */
      GPIO_PinInit(GPIO5, 13U, &ENABLE_6V5_config);
      IOMUXC_SetPinMux(
           IOMUXC_GPIO_DISP_B2_12_GPIO_MUX5_IO13,  /* GPIO_DISP_B2_13 is configured as GPIO_MUX5_IO13 */
           0U);                                    /* Software Input On Field: Input Path is determined by functionality */

      /* GPIO configuration of CAMERA_FREX on GPIO_DISP_B2_13 (pin A5) */
      gpio_pin_config_t CAMERA_FREX_config = {
          .direction = kGPIO_DigitalOutput,
          .outputLogic = 0U,
          .interruptMode = kGPIO_NoIntmode
      };
      /* Initialize GPIO functionality on GPIO_DISP_B2_13 (pin A5) */
      GPIO_PinInit(GPIO5, 14U, &CAMERA_FREX_config);
      IOMUXC_SetPinMux(
           IOMUXC_GPIO_DISP_B2_13_GPIO_MUX5_IO14,  /* GPIO_DISP_B2_13 is configured as GPIO_MUX5_IO14 */
           0U);                                    /* Software Input On Field: Input Path is determined by functionality */
      IOMUXC_SetPinMux(
          IOMUXC_GPIO_DISP_B2_13_GPIO11_IO14,     /* GPIO_DISP_B2_13 is configured as GPIO11_IO14 */
          0U);                                    /* Software Input On Field: Input Path is determined by functionality */


      /* GPIO configuration of CAMERA_RESET on GPIO_DISP_B2_14 (pin A7) */
      gpio_pin_config_t CAMERA_RESET_config = {
          .direction = kGPIO_DigitalOutput,
          .outputLogic = 0U,
          .interruptMode = kGPIO_NoIntmode
      };
      /* Initialize GPIO functionality on GPIO_DISP_B2_14 (pin A7) */
      GPIO_PinInit(GPIO5, 15U, &CAMERA_RESET_config);
      IOMUXC_SetPinMux(
          IOMUXC_GPIO_DISP_B2_14_GPIO_MUX5_IO15,  /* GPIO_DISP_B2_14 is configured as GPIO_MUX5_IO15 */
          0U);                                    /* Software Input On Field: Input Path is determined by functionality */

#if(1)
      IOMUXC_SetPinMux(						// ts. Not sure this is necessary, this will turn in to an Analog pin.  But just to be sure..
          IOMUXC_GPIO_AD_04_GPIO9_IO03,
          0x0A);
      IOMUXC_SetPinConfig(
    	  IOMUXC_GPIO_AD_04_GPIO9_IO03,
          0x00U);
      	gpio_pin_config_t ANALOG_gpio_config =
      	{
      		.direction = kGPIO_DigitalInput,
			.outputLogic = 0,
			.interruptMode = kGPIO_NoIntmode
      	};
    	GPIO_PinInit(GPIO9, 3, &ANALOG_gpio_config );

        IOMUXC_SetPinMux(					// ts. Not sure this is necessary, this will turn in to an Analog pin.  But just to be sure.
        	IOMUXC_GPIO_AD_00_GPIO8_IO31,
            0x0A);
        IOMUXC_SetPinConfig(
        	IOMUXC_GPIO_AD_00_GPIO8_IO31,
            0x00U);
      	GPIO_PinInit(GPIO8, 31, &ANALOG_gpio_config );

#endif




  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_00_ENET_QOS_RX_EN,  /* GPIO_DISP_B1_00 is configured as ENET_QOS_RX_EN */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_01_ENET_QOS_RX_CLK,  /* GPIO_DISP_B1_01 is configured as ENET_QOS_RX_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_02_ENET_QOS_RX_DATA00,  /* GPIO_DISP_B1_02 is configured as ENET_QOS_RX_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_03_ENET_QOS_RX_DATA01,  /* GPIO_DISP_B1_03 is configured as ENET_QOS_RX_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_04_ENET_QOS_RX_DATA02,  /* GPIO_DISP_B1_04 is configured as ENET_QOS_RX_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_05_ENET_QOS_RX_DATA03,  /* GPIO_DISP_B1_05 is configured as ENET_QOS_RX_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_06_ENET_QOS_TX_DATA03,  /* GPIO_DISP_B1_06 is configured as ENET_QOS_TX_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_07_ENET_QOS_TX_DATA02,  /* GPIO_DISP_B1_07 is configured as ENET_QOS_TX_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_08_ENET_QOS_TX_DATA01,  /* GPIO_DISP_B1_08 is configured as ENET_QOS_TX_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_09_ENET_QOS_TX_DATA00,  /* GPIO_DISP_B1_09 is configured as ENET_QOS_TX_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_10_ENET_QOS_TX_EN,  /* GPIO_DISP_B1_10 is configured as ENET_QOS_TX_EN */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_11_ENET_QOS_TX_CLK,  /* GPIO_DISP_B1_11 is configured as ENET_QOS_TX_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */

  // Disconnected pins
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_19_ENET_QOS_MDC,     /* GPIO_EMC_B2_19 is configured as ENET_QOS_MDC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  // Disconnected pins
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_20_ENET_QOS_MDIO,    /* GPIO_EMC_B2_20 is configured as ENET_QOS_MDIO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */


  // LPI2C1 - Phy
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_33_LPI2C1_SDA,         /* GPIO_LPSR_04 is configured as LPI2C5_SDA */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_04 */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_33_LPI2C1_SDA,         /* GPIO_LPSR_04 PAD functional properties : */
        0x2CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: normal driver
                                                   Pull / Keep Select Field: Pull Disable
                                                   Pull Up / Down Config. Field: Weak pull down
                                                   Open Drain LPSR Field: Enabled
                                                   Domain write protection: Both cores are allowed
                                                   Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_32_LPI2C1_SCL,         /* GPIO_LPSR_05 is configured as LPI2C5_SCL */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_05 */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_32_LPI2C1_SCL,         /* GPIO_LPSR_05 PAD functional properties : */
        0x2CU);                                 /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: normal driver
                                                   Pull / Keep Select Field: Pull Disable
                                                   Pull Up / Down Config. Field: Weak pull down
                                                   Open Drain LPSR Field: Enabled
                                                   Domain write protection: Both cores are allowed
                                                   Domain write protection lock: Neither of DWP bits is locked */



