seantippett/MultiSensor-with-Oryx/multisensor_oryx_freertos_cm7/board/pin_mux.c
 // LPUART2
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD,          /* GPIO_DISP_B2_10 is configured as LPUART2_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD,          /* GPIO_DISP_B2_10 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD,          /* GPIO_DISP_B2_11 is configured as LPUART2_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD,          /* GPIO_DISP_B2_11 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */


	gpio_pin_config_t gpioOutput_config = {
	  .direction = kGPIO_DigitalOutput,
	  .outputLogic = 0U,
	  .interruptMode = kGPIO_NoIntmode
	};
	gpio_pin_config_t gpioInput_config = {
	  .direction = kGPIO_DigitalInput,
	  .outputLogic = 0U,
	  .interruptMode = kGPIO_NoIntmode
	};


// PHY_INT
	/* Initialize GPIO functionality on GPIO_AD_06 (pin N13) */
	GPIO_PinInit(GPIO9, 5U, &gpioInput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_06_GPIO9_IO05,       /* GPIO_AD_06 is configured as GPIO9_IO05 */
		0U);

// PHY_RESET
	/* Initialize GPIO functionality on GPIO_AD_06 (pin N13) */
	GPIO_PinInit(GPIO9, 8U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_09_GPIO9_IO08,       /* GPIO_AD_09 is configured as GPIO9_IO08 */
		0U);

// PHY_PME_N
	/* Initialize GPIO functionality on GPIO_AD_06 (pin N13) */
	GPIO_PinInit(GPIO9, 21U, &gpioInput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_22_GPIO9_IO21,       /* GPIO_AD_22 is configured as GPIO9_IO21 */
		0U);



// Visible LED  - LED_SIDE_A_POWER_FAULT
    /* Initialize GPIO functionality on GPIO_DISP_B2_07 (pin D6) */
    GPIO_PinInit(GPIO11, 8U, &gpioOutput_config);
    IOMUXC_SetPinMux(
    	IOMUXC_GPIO_DISP_B2_07_GPIO11_IO08,      /* GPIO_DISP_B2_07 is configured as GPIO_11_IO08 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */


// Visible LED  - LED_SIDE_B_POWER_FAULT
    /* Initialize GPIO functionality on GPIO_DISP_B2_09 (pin D8) */
    GPIO_PinInit(GPIO11, 10U, &gpioOutput_config);
    IOMUXC_SetPinMux(
    	IOMUXC_GPIO_DISP_B2_09_GPIO11_IO10,      /* GPIO_DISP_B2_09 is configured as GPIO_11_IO10 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// Visible LED  - LED_CAMERA
    /* Initialize GPIO functionality on GPIO_AD_05 (pin P13) */
    GPIO_PinInit(GPIO9, 4U, &gpioOutput_config);
    IOMUXC_SetPinMux(
    	IOMUXC_GPIO_AD_05_GPIO9_IO04,       /* GPIO_AD_05 is configured as GPIO9_IO04 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// Visible LED  - LED_HEARTBEAT
	/* Initialize GPIO functionality on GPIO_AD_08 (pin R15) */
	GPIO_PinInit(GPIO9, 7U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_08_GPIO9_IO07,       /* GPIO_AD_08 is configured as GPIO9_IO07 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// Visible LED  - LED_SIDE_A_PIR
	/* Initialize GPIO functionality on GPIO_AD_10 (pin R17) */
	GPIO_PinInit(GPIO9, 9U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_10_GPIO9_IO09,       /* GPIO_AD_10 is configured as GPIO9_IO09 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// Visible LED  - LED_SIDE_B_PIR
	/* Initialize GPIO functionality on GPIO_AD_11 (pin P16) */
	GPIO_PinInit(GPIO9, 10U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_11_GPIO9_IO10,       /* GPIO_AD_11 is configured as GPIO9_IO10 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// Visible LED  - LED_RADAR
	/* Initialize GPIO functionality on GPIO_AD_19 (pin L16) */
	GPIO_PinInit(GPIO9, 18U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_19_GPIO9_IO18,       /* GPIO_AD_19 is configured as GPIO9_IO18 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// Visible LED  - LED_ACCEL
	/* Initialize GPIO functionality on GPIO_AD_27 (pin N16) */
	GPIO_PinInit(GPIO9, 26U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_27_GPIO9_IO26,       /* GPIO_AD_26 is configured as GPIO9_IO26 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// IR LED  - Strobe on.
	/* Initialize GPIO functionality on GPIO_AD_23 (pin J12) */
	GPIO_PinInit(GPIO9, 22U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_23_GPIO9_IO22,       /* GPIO_AD_26 is configured as GPIO9_IO26 */
		1U);                                    /* Software Input On Field: Input Path is determined by functionality */

// EFUSE  - FLT_A
	/* Initialize GPIO functionality on GPIO_AD_03 (pin P15) */
	GPIO_PinInit(GPIO9, 2U, &gpioInput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_03_GPIO9_IO02,       /* GPIO_AD_03 is configured as GPIO9_IO02 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
// EFUSE  - FLT_B
	/* Initialize GPIO functionality on GPIO_AD_17 (pin N15) */
	GPIO_PinInit(GPIO9, 16U, &gpioInput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_17_GPIO9_IO16,       /* GPIO_AD_03 is configured as GPIO9_IO02 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// EFUSE  - SHDN_A
	/* Initialize GPIO functionality on GPIO_AD_07 (pin T17) */
	GPIO_PinInit(GPIO9, 6U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_07_GPIO9_IO06,       /* GPIO_AD_07 is configured as GPIO9_IO06 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
// EFUSE  - SHDN_B
	/* Initialize GPIO functionality on GPIO_AD_01 (pin R14) */
	GPIO_PinInit(GPIO9, 0U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_01_GPIO9_IO00,       /* GPIO_AD_01 is configured as GPIO9_IO00 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */

// External Watchdog

