seantippett/MultiSensor-with-Oryx/multisensor_oryx_freertos_cm7/board/pin_mux.c
// NO!  don't do this here.  Tristate state is 'disable' to the watchdog.  We want this disabled for now.
	/* Initialize GPIO functionality on GPIO_DISP_B2_15 (pin A4) */
//	GPIO_PinInit(GPIO5, 16U, &gpioOutput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_DISP_B2_15_GPIO_MUX5_IO16,       /* GPIO_DISP_B2_15 is configured as GPIO5_IO16 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
// INSTEAD... set it as an input.  this makes the pin tristate.  Need to turn this to an output before use.
	GPIO_PinInit(GPIO5, 16U, &gpioInput_config);

// Setting RESET Push Button
	/* Initialize GPIO functionality on GPIO_LPSR_00 (pin N6) */
	GPIO_PinInit(GPIO6, 0U, &gpioInput_config);
	IOMUXC_SetPinMux(
		IOMUXC_GPIO_LPSR_00_GPIO_MUX6_IO00,       /* GPIO_LPSR_00 is configured as GPIO6_IO0 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_00_GPIO_MUX6_IO00,IOMUXC_SW_PAD_CTL_PAD_PULL(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1));		// turn on weak pull up.



	// GPIO09.14 = PIR1, Direct Link.
	GPIO_PinInit(GPIO9, 14U, &gpioOutput_config);
	IOMUXC_SetPinMux(
			IOMUXC_GPIO_AD_15_GPIO9_IO14,
			0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinConfig(
			IOMUXC_GPIO_AD_15_GPIO9_IO14,          /* GPIO_DISP_B2_11 PAD functional properties : */
			0x0EU);                                 // High drive strength, PU enabled.
	GPIO_PinWrite(GPIO9, (14U), 0U);

// GPIO09.1 = PIR1, Serial Link.
	GPIO_PinInit(GPIO9, 1U, &gpioOutput_config);
	IOMUXC_SetPinMux(
			IOMUXC_GPIO_AD_02_GPIO9_IO01,
			0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinConfig(
			IOMUXC_GPIO_AD_02_GPIO9_IO01,          /* GPIO_DISP_B2_11 PAD functional properties : */
			0x02U);                                 // High drive strength.

// GPIO09.15 = PIR2, Direct Link.
	GPIO_PinInit(GPIO9, 15U, &gpioOutput_config);
	IOMUXC_SetPinMux(
			IOMUXC_GPIO_AD_16_GPIO9_IO15,
			0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinConfig(
			IOMUXC_GPIO_AD_16_GPIO9_IO15,          /* GPIO_DISP_B2_11 PAD functional properties : */
			0x0EU);                                 // High drive strength, PU enabled.
	GPIO_PinWrite(GPIO9, (15U), 0U);

// GPIO011.9 = PIR2, Serial Link.
	GPIO_PinInit(GPIO11, 9U, &gpioOutput_config);
	IOMUXC_SetPinMux(
			IOMUXC_GPIO_DISP_B2_08_GPIO11_IO09,
			0U);
	IOMUXC_SetPinConfig(
			IOMUXC_GPIO_DISP_B2_08_GPIO11_IO09,          /* GPIO_DISP_B2_11 PAD functional properties : */
			0x02U);                                 // High drive strength.


// HF MEMS - CLK - PDM
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_LPSR_08_MIC_CLK,            /* GPIO_LPSR_08 is configured as MIC_CLK */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_LPSR_08_MIC_CLK,            /* GPIO_LPSR_08 PAD functional properties : */
	  0x03U);                                 /* Slew Rate Field: Fast Slew Rate
												 Drive Strength Field: high driver
												 Pull / Keep Select Field: Pull Disable
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain LPSR Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */

// HF MEMS - BITSTREAM0 - PDM
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_LPSR_09_MIC_BITSTREAM0,     /* GPIO_LPSR_09 is configured as MIC_BITSTREAM0 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */


	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_LPSR_09_MIC_BITSTREAM0,     /* GPIO_LPSR_09 PAD functional properties : */
	  0x03U);                                 /* Slew Rate Field: Fast Slew Rate
												 Drive Strength Field: high driver
												 Pull / Keep Select Field: Pull Disable
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain LPSR Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */

// HF MEMS - BITSTREAM1 - PDM
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_LPSR_10_MIC_BITSTREAM1,     /* GPIO_LPSR_10 is configured as MIC_BITSTREAM1 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */

	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_LPSR_10_MIC_BITSTREAM1,     /* GPIO_LPSR_10 PAD functional properties : */
	  0x03U);                                 /* Slew Rate Field: Fast Slew Rate
												 Drive Strength Field: high driver
												 Pull / Keep Select Field: Pull Disable
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain LPSR Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */


	// SW SPI //
#if(0)
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03,    /* GPIO_SD_B2_05 is configured as FLEXSPI1_A_DQS */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_05 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02,  /* GPIO_SD_B2_06 is configured as FLEXSPI1_A_SS0_B */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_06 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01,   /* GPIO_SD_B2_07 is configured as FLEXSPI1_A_SCLK */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_07 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00,  /* GPIO_SD_B2_08 is configured as FLEXSPI1_A_DATA00 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_08 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK,  /* GPIO_SD_B2_09 is configured as FLEXSPI1_A_DATA01 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_09 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_05_FLEXSPI1_B_SS0_B,  /* GPIO_SD_B2_10 is configured as FLEXSPI1_A_DATA02 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_10 */
#endif
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_00_GPIO10_IO09,    /* GPIO_SD_B2_05 is configured as FLEXSPI1_A_DQS */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_05 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_01_GPIO10_IO10,  /* GPIO_SD_B2_06 is configured as FLEXSPI1_A_SS0_B */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_06 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_02_GPIO10_IO11,   /* GPIO_SD_B2_07 is configured as FLEXSPI1_A_SCLK */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_07 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_03_GPIO10_IO12,  /* GPIO_SD_B2_08 is configured as FLEXSPI1_A_DATA00 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_08 */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_04_GPIO10_IO13,  /* GPIO_SD_B2_09 is configured as FLEXSPI1_A_DATA01 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_09 */

    // You need to burn fuse: FLEX_SPI_PIN_SEL at bit 11 of fuse 0x9A0 to use the following GPIO pin.
    // note that you then must turn on the DQS pin on EMC_B2_18 prior to switching to over the SD_B2_05 pin.  The
    // commands below do this in the correct order.  If you perform this the other way around, your program won't
    // execute correctly.  T.S. 2023 05 30

    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_EMC_B2_18_FLEXSPI1_A_DQS ,  /* */
        1U);                                        /* */
    IOMUXC_SetPinMux(
    		IOMUXC_GPIO_SD_B2_05_GPIO10_IO14,  /* GPIO_SD_B2_10 is configured as FLEXSPI1_A_DATA02 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B2_10 */


	EFUSE_A_SHUTDOWN_UN_ASSERT;
	EFUSE_A_SHUTDOWN_UN_ASSERT;
	LED_OFF_ALL;
	PHY_RESET_UNASSERT;
	DIAG_E8_OFF;
	LED_ARRAY_STROBE_ON;
	LED_ARRAY_CHARGE_ON;


